{"uuid":"2d809da647eee11716b01ffd461d22b32f04e890","bioAsHtml":"<p>Depuis près de dix ans, quand il ne contribue pas à Wikipédia, Sylvain Veyrié développe sur la plateforme Java, ce qui l&#x27;a naturellement amené à se convertir à Scala.</p>\n<p>Il a été développeur, chef de projet, administrateur système, architecte, formateur et d&#x27;autres trucs sur la plateforme forfait de Key Consulting, pilotant techniquement tout ce qui concerne Java et l&#x27;industrialisation logicielle. Il est aussi intervenu aussi comme expert et formateur sur ces sujets dans plusieurs entreprises, ainsi qu&#x27;en école d&#x27;ingénieurs.</p>\n<p>Il est depuis 18 mois chargé du delivery chez Transparency Rights Management, plongeant dans le bain de Scala et de la Big Data, pour aider l&#x27;univers de la musique.</p>\n","acceptedTalks":[{"talkType":"Short conference","track":"BigData & MachineLearning","links":[{"href":"http://cfp.scala.io/api/conferences/ScalaIOFR2016/talks/OZV-8736","rel":"http://cfp.scala.io/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.scala.io/api/conferences/ScalaIOFR2016/speakers/2d809da647eee11716b01ffd461d22b32f04e890","rel":"http://cfp.scala.io/api/profile/speaker","title":"Sylvain Veyrié"},{"href":"http://cfp.scala.io/api/conferences/ScalaIOFR2016/speakers/b3078693011bf3ae1fa0c197c6e59cf23a7f23f8","rel":"http://cfp.scala.io/api/profile/speaker","title":"Cyrille Chépélov"}],"id":"OZV-8736","title":"Scalding + Cascading + TEZ = ♥"}],"company":"Transparency Rights Management","bio":"Depuis près de dix ans, quand il ne contribue pas à Wikipédia, Sylvain Veyrié développe sur la plateforme Java, ce qui l'a naturellement amené à se convertir à Scala.\r\n\r\nIl a été développeur, chef de projet, administrateur système, architecte, formateur et d'autres trucs sur la plateforme forfait de Key Consulting, pilotant techniquement tout ce qui concerne Java et l'industrialisation logicielle. Il est aussi intervenu aussi comme expert et formateur sur ces sujets dans plusieurs entreprises, ainsi qu'en école d'ingénieurs.\r\n\r\nIl est depuis 18 mois chargé du delivery chez Transparency Rights Management, plongeant dans le bain de Scala et de la Big Data, pour aider l'univers de la musique.","lastName":"Veyrié","firstName":"Sylvain","blog":null,"avatarURL":"https://lh3.googleusercontent.com/-KeSYJ7UIIjQ/UyGmd0-Sn7I/AAAAAAAAIH0/_oZjIqkMnqw/s512/tete512.png","twitter":null,"lang":"fr"}