{"uuid":"6b12b80e28ace01547216eadbe535c59a684e8d7","bioAsHtml":"<p>Martin Odersky created the Scala programming language and is a professor in the programming research group at EPFL, the leading technical university in Switzerland. Throughout his career, Martin&#x27;s singular objective has been to make the basic job of writing programs faster, easier and more enjoyable. In the process, he has personally written more lines of Java and Scala code than almost any other individual in the world. He wrote javac, the compiler used by the majority of today&#x27;s Java programmers, and scalac, the compiler used by the fast-growing Scala community. He authored &quot;Programming in Scala,&quot; the best-selling book on Scala. Previously he has held positions at IBM Research, Yale University, University of Karlsruhe and University of South Australia, after having obtained his doctorate from ETH Zürich as a student of Niklaus Wirth, the creator of Pascal.</p>\n","acceptedTalks":[{"talkType":"Keynote","track":"Scala & Ecosystem","links":[{"href":"http://cfp.scala.io/api/conferences/ScalaIOFR2016/talks/CZV-7132","rel":"http://cfp.scala.io/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.scala.io/api/conferences/ScalaIOFR2016/speakers/6b12b80e28ace01547216eadbe535c59a684e8d7","rel":"http://cfp.scala.io/api/profile/speaker","title":"Martin Odersky"}],"id":"CZV-7132","title":"Dotty"}],"company":"EPFL","bio":"Martin Odersky created the Scala programming language and is a professor in the programming research group at EPFL, the leading technical university in Switzerland. Throughout his career, Martin's singular objective has been to make the basic job of writing programs faster, easier and more enjoyable. In the process, he has personally written more lines of Java and Scala code than almost any other individual in the world. He wrote javac, the compiler used by the majority of today's Java programmers, and scalac, the compiler used by the fast-growing Scala community. He authored \"Programming in Scala,\" the best-selling book on Scala. Previously he has held positions at IBM Research, Yale University, University of Karlsruhe and University of South Australia, after having obtained his doctorate from ETH Zürich as a student of Niklaus Wirth, the creator of Pascal.","lastName":"Odersky","firstName":"Martin","blog":null,"avatarURL":"https://pbs.twimg.com/profile_images/673909115/Martin_400x400.JPG","twitter":"@odersky","lang":"en"}