{"uuid":"bb335ce342b0e618612884c91f39217c187a3407","bioAsHtml":"<p>Je travaille au Data Innovation Lab d&#x27;Axa à Paris en tant que Data Software Engineer, ce qui consiste principalement à apporter du Software Enginnering à des projets de Data Science. Je suis docteur en intelligence artificielle, et j&#x27;aime garder ma casquette de chercheur sous la main pour voir les problèmes sous différents angles.</p>\n<p>J&#x27;aime découvrir de nouveaux langages et de nouvelles technologies : j&#x27;apprécie particulièrement Haskell, mais je travaille en Scala et je garde un faible pour Python. Je collabore sur le projet NixOS et je coach dans des programmes de soutien de la diversité comme Django Girls.</p>\n<p>Une fois de temps en temps, j&#x27;aime perdre tout un après-midi sur un jeu de grande stratégie de chez Paradox.</p>\n","acceptedTalks":[{"talkType":"Hands-on Labs","track":"Type & Functional Programming","links":[{"href":"http://cfp.scala.io/api/conferences/ScalaIOFR2016/talks/RFK-3199","rel":"http://cfp.scala.io/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.scala.io/api/conferences/ScalaIOFR2016/speakers/bb335ce342b0e618612884c91f39217c187a3407","rel":"http://cfp.scala.io/api/profile/speaker","title":"Georges Dubus"}],"id":"RFK-3199","title":"Parser des fichiers avec des parser combinators ! "}],"company":"AXA — Data Innovation Lab","bio":"Je travaille au Data Innovation Lab d'Axa à Paris en tant que Data Software Engineer, ce qui consiste principalement à apporter du Software Enginnering à des projets de Data Science. Je suis docteur en intelligence artificielle, et j'aime garder ma casquette de chercheur sous la main pour voir les problèmes sous différents angles.\r\n\r\nJ'aime découvrir de nouveaux langages et de nouvelles technologies : j'apprécie particulièrement Haskell, mais je travaille en Scala et je garde un faible pour Python. Je collabore sur le projet NixOS et je coach dans des programmes de soutien de la diversité comme Django Girls.\r\n\r\nUne fois de temps en temps, j'aime perdre tout un après-midi sur un jeu de grande stratégie de chez Paradox.","lastName":"Dubus","firstName":"Georges","blog":"https://compiletoi.net","avatarURL":"http://www.gravatar.com/avatar/44e220c5150326866af030a7c9d944b3","twitter":"@georgesdubus","lang":"en"}