{"uuid":"c63fcf3d4f6711ddde42f79637d4bc3c8a4bcd00","bioAsHtml":"<p>I&#x27;m a tech-recruiter in NYC who focuses on functional programming (mainly Scala), and the proverbial &quot;Devops&quot; space.  I&#x27;m also a fitness nut - I teach spin, run, etc., I write and perform poetry, and love presenting in front of a crowd.</p>\n<p>I take a unique approach to recruiting which is:  I&#x27;m just me.  I&#x27;m an eccentric, kind or weird / geeky dude.  I don&#x27;t hide that or pretend to be otherwise.  I also happen to think the FP space is pretty interesting and love learning more about it.</p>\n<p>You should come talk to me if you want to know what&#x27;s going on in the Scala community at large, if you need any information or questions answered about Batman, or you want to talk/laugh about how terrible the recruiting &amp; interviewing process has become!</p>\n","acceptedTalks":[{"talkType":"Short conference","track":"Scala & Ecosystem","links":[{"href":"http://cfp.scala.io/api/conferences/ScalaIOFR2016/talks/WKU-9477","rel":"http://cfp.scala.io/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.scala.io/api/conferences/ScalaIOFR2016/speakers/c63fcf3d4f6711ddde42f79637d4bc3c8a4bcd00","rel":"http://cfp.scala.io/api/profile/speaker","title":"Michael Cohen"}],"id":"WKU-9477","title":"The Real Scala Engineers of Planet Earth "}],"company":"Continuity Partners, Inc. (CPI)","bio":"I'm a tech-recruiter in NYC who focuses on functional programming (mainly Scala), and the proverbial \"Devops\" space.  I'm also a fitness nut - I teach spin, run, etc., I write and perform poetry, and love presenting in front of a crowd.\r\n\r\nI take a unique approach to recruiting which is:  I'm just me.  I'm an eccentric, kind or weird / geeky dude.  I don't hide that or pretend to be otherwise.  I also happen to think the FP space is pretty interesting and love learning more about it.\r\n\r\nYou should come talk to me if you want to know what's going on in the Scala community at large, if you need any information or questions answered about Batman, or you want to talk/laugh about how terrible the recruiting & interviewing process has become!","lastName":"Cohen","firstName":"Michael","blog":"wax-poetic.org","avatarURL":"https://media.licdn.com/media/AAEAAQAAAAAAAAj0AAAAJGE0MDMzOTBlLWVkZDUtNGVmMi1hMzFjLTY2ODZhMTYzNjlkNg.jpg","twitter":"@GothamTechTalk","lang":"fr"}