{"uuid":"0975ef1112319f9f82a58aa5db8494002ed59c7c","bioAsHtml":"<p>Student in Computer Science in Université Pierre et Marie Curie (Paris 6), interested in programming languages theory, especially functionnal programming and systems programming, he&#x27;s very interested in the Rust language and dedicated a lot of time to it, either through minor contributions to the language itself, or through many personnal projects related to it, as well as co-organizing the Parisian Rust meetups at Mozilla.</p>\n","acceptedTalks":[{"talkType":"Conference","track":"Alternate languages","audienceLevel":"intermediate","summaryAsHtml":"<p>Rust est un nouveau langage de programmation créé par Mozilla pour allier la performance et le contrôle fournis par les langages de programmation système traditionnels tels C++ et la sûreté du typage statique fort.\nCette présentation se veut une présentation générale de Rust, en mettant l&#x27;accent sur les aspects nouveaux, notamment le système de gestion de la mémoire</p>\n","links":[{"href":"http://cfp.scala.io/api/conferences/scalaIOFR2014/talks/DKA-157","rel":"http://cfp.scala.io/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.scala.io/api/conferences/scalaIOFR2014/speakers/0975ef1112319f9f82a58aa5db8494002ed59c7c","rel":"http://cfp.scala.io/api/profile/speaker","title":"Léo Testard"}],"id":"DKA-157","title":"Sûreté mémoire avec Rust","talkLang":"fr"}],"company":"UPMC","bio":"Student in Computer Science in Université Pierre et Marie Curie (Paris 6), interested in programming languages theory, especially functionnal programming and systems programming, he's very interested in the Rust language and dedicated a lot of time to it, either through minor contributions to the language itself, or through many personnal projects related to it, as well as co-organizing the Parisian Rust meetups at Mozilla.","lastName":"Testard","firstName":"Léo","blog":"https://mozillians.org/fr/u/Leo_Testard/","avatarURL":"https://scontent-a-mad.xx.fbcdn.net/hphotos-xpa1/v/t1.0-9/10552462_888183787876386_7084388662982120320_n.jpg?oh=c9e964d58b457a8c68cc00820910a968&oe=54C129E0","twitter":"@Leo_Testard","lang":"fr"}
