{"uuid":"7cae30b6998e8b2822fa9022bd2be41454b0dd56","bioAsHtml":"<p>Renato Cavalcanti is an independent Scala developer based in Belgium. Coming from a totally different field (psychology), he discovered a passion for programming in 1999. Scala aficionado since 2009, he has been hacking in Scala and related technologies for fun and profit. He&#x27;s the founder of BeScala and steering committee member of the BeJUG.</p>\n","acceptedTalks":[{"talkType":"Conference","track":"Scala and the Real World","audienceLevel":"intermediate","summaryAsHtml":"<p>In a Scala/Slick we deal with data and persistence in a totally different way if compared with the OOP/ORM world. Our model are immutable structures (case classes and tuples), nullable columns are mapped to Options, relations are expressed by id references instead of object associations.</p>\n<p>In this talk we&#x27;ll show how to implement an type-safe Active Record Pattern using Slick and how to promote your database rows to first-class citizens and embrace a totally different way of modeling.</p>\n","links":[{"href":"http://cfp.scala.io/api/conferences/scalaIOFR2014/talks/RMH-144","rel":"http://cfp.scala.io/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.scala.io/api/conferences/scalaIOFR2014/speakers/7cae30b6998e8b2822fa9022bd2be41454b0dd56","rel":"http://cfp.scala.io/api/profile/speaker","title":"Renato Cavalcanti"}],"id":"RMH-144","title":"Implementing the Active Record Pattern in Slick","talkLang":"en"}],"company":"Strong[Typed]","bio":"Renato Cavalcanti is an independent Scala developer based in Belgium. Coming from a totally different field (psychology), he discovered a passion for programming in 1999. Scala aficionado since 2009, he has been hacking in Scala and related technologies for fun and profit. He's the founder of BeScala and steering committee member of the BeJUG.","lastName":"Cavalcanti","firstName":"Renato","blog":"www.strongtyped.io","avatarURL":"http://www.gravatar.com/avatar/fbf9d11675801fb97aa2247ad4d3109c.png","twitter":"@renatocaval","lang":"fr"}
