{"uuid":"9c8705ff838cbd74f873cacb831fedae42550461","bioAsHtml":"<p>Fondateur d&#x27;Affini-Tech, j&#x27;interviens comme Data-Architect entre autre sur des projets de construction de plateformes Bigdata. Spécialiste d&#x27;Hadoop et de Spark, je met en oeuvre des pipelines de traitement de données à grande échelle pour des clients, mixant traitements massifs et Machine Learning. Je co-anime le podcast Bigdatahebdo, et participe activement aux communautés Hadoop User Group et Paris Datageek.</p>\n","acceptedTalks":[{"talkType":"Short conference","track":"Data and Scala","audienceLevel":"novice","summaryAsHtml":"<p>L&#x27;approche fonctionnelle pour traiter de gros volumes de données semble être une évidence, et pourtant l&#x27;écosystème Bigdata s&#x27;ouvre peu à peu. Nous balayerons ensemble les différentes solutions et leurs alternatives à base de Scala disponibles et en fonction des cas d&#x27;usages. La popularité de certains frameworks est parfois déroutante quand il s&#x27;agit faire des choix structurants. C&#x27;est avec un avis objectivé sur ces choix technologiques que vous repartirez. Vous saurez quels choix faire entre Hadoop classique, Scalding, Spark...</p>\n","links":[{"href":"http://cfp.scala.io/api/conferences/scalaIOFR2014/talks/KVT-175","rel":"http://cfp.scala.io/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.scala.io/api/conferences/scalaIOFR2014/speakers/9c8705ff838cbd74f873cacb831fedae42550461","rel":"http://cfp.scala.io/api/profile/speaker","title":"Vincent Heuschling"}],"id":"KVT-175","title":"Pourquoi utiliser Scala dans un contexte Bigdata ?","talkLang":"fr"}],"company":"Affini-Tech","bio":"Fondateur d'Affini-Tech, j'interviens comme Data-Architect entre autre sur des projets de construction de plateformes Bigdata. Spécialiste d'Hadoop et de Spark, je met en oeuvre des pipelines de traitement de données à grande échelle pour des clients, mixant traitements massifs et Machine Learning. Je co-anime le podcast Bigdatahebdo, et participe activement aux communautés Hadoop User Group et Paris Datageek. ","lastName":"Heuschling","firstName":"Vincent","blog":"http://blog.affini-tech.com","avatarURL":"https://lh6.googleusercontent.com/-V2itrJ5slUk/AAAAAAAAAAI/AAAAAAAAABg/gh-lL3oaio4/photo.jpg","twitter":"@vhe74","lang":"fr"}
