{"uuid":"a0e8eccb35c7c7a9bec822e6d7ee37f9c08eca5c","bioAsHtml":"<p>A programming junkie and computer history aficionado, Tomer&#x27;s been around the block a few times before settling at Wix as a system architect. In the last couple of years he&#x27;s developed a major crush on Scala, promoting it within the Israeli software industry as part of JJTV (Java &amp; JVM Tel-Aviv user group) and Underscore (Israeli Scala user group) and organizing the annual Scalapeño conference in Tel-Aviv.</p>\n","acceptedTalks":[{"talkType":"Conference","track":"Scala as a language","audienceLevel":"intermediate","summaryAsHtml":"<p>Scala&#x27;s powerful type system and flexible syntax enable the design of internal DSLs, e.g. for test specifications in Specs²/ScalaTest, routing in Spray and query construction in Squeryl. While immensely useful, the budding DSL designer will quickly realize that there are precious few resources on how to approach DSL construction in Scala; the techniques, limitations and workarounds are not well understood or documented. In this talk I&#x27;ll attempt to summarize lessons learned from reading, extending and designing Scala DSLs in the hopes of saving future Scala library designers a world of pain.</p>\n","links":[{"href":"http://cfp.scala.io/api/conferences/scalaIOFR2014/talks/MDB-738","rel":"http://cfp.scala.io/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.scala.io/api/conferences/scalaIOFR2014/speakers/a0e8eccb35c7c7a9bec822e6d7ee37f9c08eca5c","rel":"http://cfp.scala.io/api/profile/speaker","title":"Tomer Gabel"}],"id":"MDB-738","title":"A Field Guide to DSL Design","talkLang":"en"}],"company":"Wix","bio":"A programming junkie and computer history aficionado, Tomer's been around the block a few times before settling at Wix as a system architect. In the last couple of years he's developed a major crush on Scala, promoting it within the Israeli software industry as part of JJTV (Java & JVM Tel-Aviv user group) and Underscore (Israeli Scala user group) and organizing the annual Scalapeño conference in Tel-Aviv.\r\n","lastName":"Gabel","firstName":"Tomer","blog":"http://www.tomergabel.com","avatarURL":"https://lh5.googleusercontent.com/-T_Ba_SOAk5o/AAAAAAAAAAI/AAAAAAAAAFc/mKFItNyMVSc/photo.jpg","twitter":"@tomerg","lang":"fr"}
