{"uuid":"bed2455ec833a11470efacf9bbd17d5b57a1e36d","bioAsHtml":"<p>Manuel is an independent software consultant with a passion for building web-oriented systems, both back-end and front-end.\nHe started working with Scala, Akka and Play Framework in 2010 after spending a long time with Java. He lives in Vienna, where he is co-organiser of the local Scala User Group. He&#x27;s enthusiastic about the Scala-based technologies and the vibrant community, and is looking for ways to spread its usage in the industry</p>\n","acceptedTalks":[{"talkType":"Conference","track":"Scala and the Real World","audienceLevel":"intermediate","summaryAsHtml":"<p>Talenthouse is a Los-Angeles based start-up offering an online platform for creative collaboration and brand advertisement with over 3 million users. In the end of 2013 it became clear that the existing platform was not performing well enough anymore and that a new system had to be built, and all of its data migrated - in one &quot;big-bang&quot; week-end.</p>\n<p>This is the story of how <a href=\"http://akka.io\">Akka</a> was used to build an entirely reactive, high-throughput, failure-tolerant data migration pipeline, fetching data from multiple databases, cloud storages, YouTube, SoundCloud and other locations.</p>\n","links":[{"href":"http://cfp.scala.io/api/conferences/scalaIOFR2014/talks/FMG-782","rel":"http://cfp.scala.io/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.scala.io/api/conferences/scalaIOFR2014/speakers/bed2455ec833a11470efacf9bbd17d5b57a1e36d","rel":"http://cfp.scala.io/api/profile/speaker","title":"Manuel Bernhardt"}],"id":"FMG-782","title":"Back to the future: actors and pipes - using Akka for large-scale data migration","talkLang":"en"}],"company":"Freelance","bio":"Manuel is an independent software consultant with a passion for building web-oriented systems, both back-end and front-end.\r\nHe started working with Scala, Akka and Play Framework in 2010 after spending a long time with Java. He lives in Vienna, where he is co-organiser of the local Scala User Group. He's enthusiastic about the Scala-based technologies and the vibrant community, and is looking for ways to spread its usage in the industry","lastName":"Bernhardt","firstName":"Manuel","blog":"http://manuel.bernhardt.io","avatarURL":"https://s.gravatar.com/avatar/06156f543560f9fddcfdab87393ac816?s=460","twitter":"@elmanu","lang":"fr"}
