{"uuid":"e4955ceef4650e69d35fb1733b4f0c22475f6329","bioAsHtml":"<p>Steve has been using Scala since 2008 and very quickly felt in love with the beauty and the expressiveness of the language.</p>\n<p>After 6 years working on distributed systems for online video-games, he joined Twitter in 2011 and he is now the Tech-lead of the Core System Libraries team. Most of his time is spent on Finagle, Twitter&#x27;s asynchronous RPC library.</p>\n","acceptedTalks":[{"talkType":"Conference","track":"Frameworks, Libraries and Ecosystem","audienceLevel":"intermediate","summaryAsHtml":"<p>Finagle is the RPC library used to build services at Twitter, it is widely used on thousands of servers, and it processes billions of messages every day. It has been designed to be fast but also reusable and composable. Finagle employs a series of algorithms to achieve efficient load balancing, fast error discovery, and more. It is protocol agnostic and there are implementations for HTTP, Thrift, Memcache, Redis, MySQL and more.</p>\n<p>This talk will describe the abstractions exposed by Finagle, as well as a brief overview of its internals and some of the algorithms used under the hood.</p>\n","links":[{"href":"http://cfp.scala.io/api/conferences/scalaIOFR2014/talks/OBQ-098","rel":"http://cfp.scala.io/api/profile/talk","title":"More details about this talk"},{"href":"http://cfp.scala.io/api/conferences/scalaIOFR2014/speakers/e4955ceef4650e69d35fb1733b4f0c22475f6329","rel":"http://cfp.scala.io/api/profile/speaker","title":"Steve Gury"}],"id":"OBQ-098","title":"Finagle: Twitter's RPC library","talkLang":"en"}],"company":"Twitter","bio":"Steve has been using Scala since 2008 and very quickly felt in love with the beauty and the expressiveness of the language. \r\n\r\nAfter 6 years working on distributed systems for online video-games, he joined Twitter in 2011 and he is now the Tech-lead of the Core System Libraries team. Most of his time is spent on Finagle, Twitter's asynchronous RPC library.","lastName":"Gury","firstName":"Steve","blog":"https://twitter.com","avatarURL":"https://dl.dropboxusercontent.com/u/142484/SteveGury2014.jpg","twitter":"@stevegury","lang":"fr"}
